Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейВОтпуске</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;      
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища); 
	ПостроитьДиаграммуОтпусков(ТаблицаОтпусков);		
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПостроитьДиаграммуОтпусков(ТаблицаОтпусков) 
	
	Объект.Год = Формат(Объект.Год, "ДФ=yyyy");
	Объект.Год = Параметры.Год;
	Отпуска_ДГ.Очистить(); 
	АвтоУстановкаТекстаТочек = Истина; 
	
	// Строим Диаграмму Ганта по ТаблицаОтпусков
	ИмяСерии = "Отпуска на " + Формат(Число(Год(Объект.Год)),"ЧГ=0" ) + " год";
	Серия = Отпуска_ДГ.УстановитьСерию(ИмяСерии);
	Для каждого Запись из ТаблицаОтпусков Цикл
		Точка = Отпуска_ДГ.УстановитьТочку(Запись.Сотрудник,Истина);
		Значение = Отпуска_ДГ.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.КоличествоДней = Запись.ДнейВОтпуске;
		Интервал = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала; 
		Интервал.Конец = Запись.ДатаОкончания;
	КонецЦикла;
	
КонецПроцедуры   

#КонецОбласти
